tutorials/incompressibleDenseParticleFluid/injectionChannel/constant/cloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      cloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type        MPPICCloud;

solution
{
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    interpolationSchemes
    {
        rho.air         cell;
        U.air           cellPoint;
        mu.air          cell;
        alpha.air       cell;
    }

    averagingMethod basic;

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U semiImplicit 1;
        }
    }
}

constantProperties
{
    rho0            1000;
}

subModels
{
    particleForces
    {
        WenYuDrag
        {
            alphac alpha.air;
        }
    }

    injectionModels
    {
        model1
        {
            type            patchInjection;
            patchName       lowerInlet;
            U0              (18.7939 6.8404 0);
            nParticle       1;
            parcelsPerSecond 1390885;
            sizeDistribution
            {
                type            normal;
                Q               0;
                min             500e-6;
                max             800e-6;
                mu              650e-6;
                sigma           25e-6;
            }
            SOI             0;
            duration        60;
        }

        model2
        {
            $model1;
            patchName       upperInlet;
            U0              (18.7939 -6.8404 0);
        }
    }

    dispersionModel none;

    patchInteractionModel localInteraction;

    localInteraction
    {
        patches
        (
            frontAndBack
            {
                type rebound;
                e    1;
                mu   0;
            }

            walls
            {
                type rebound;
                e    1;
                mu   0;
            }

            "lowerInlet|upperInlet|outlet"
            {
                type escape;
            }
        );
    }

    heatTransferModel none;

    surfaceFilmModel none;

    packingModel none;

    dampingModel relaxation;

    relaxation
    {
        timeScaleModel
        {
            type nonEquilibrium;
            alphaPacked 0.58;
            e 0.9;
        }
    }

    isotropyModel stochastic;

    stochastic
    {
        timeScaleModel
        {
            type isotropic;
            alphaPacked 0.58;
            e 0.9;
        }
    }

    stochasticCollisionModel none;

    radiation off;
}


cloudFunctions
{
    volumeFraction1
    {
        type volumeFraction;
    }

    massFlux1
    {
        type massFlux;
    }
}


// ************************************************************************* //
